Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/index.html.txt.tmx
Source language: en
Languages: ga

source: The European Council brings together the heads of state or government of every EU country,
ga: Tugann an Chomhairle Eorpach cinn stáit nó rialtais i ngach tír san AE le chéile

source: Council of the European Union
ga: Comhairle Aontas na hEorpa

source: The Council of the European Union consists of one government minister from every member state
ga: Tá an Chomhairle Aontas na hEorpa comhdhéanta d'aon Aire Rialtais amháin de gach Ballstát

source: The Council is the main decision making body in the EU
ga: Is é Comhairle an príomhchomhlacht cinnteoireachta san AE

source: This document discusses the powers of the European Commission
ga: Tá cur síos sa cháipéis seo ar chumhachtaí Choimisiún na hEorpa

source: European Court of Justice
ga: Cúirt Bhreithiúnais an Aontais Eorpaigh

source: The European Parliament represents about 502 million people in the 28 countries of the European Union
ga: Is í Parlaimint na hEorpa an institiúid a dhéanann ionadaíocht níos mó ná 503 milliún saoránach sa 28 tír an Aontais Eorpaigh

source: Members of the European Parliament
ga: Baill de Pharlaimint na hEorpa

source: There are a currently a total of 766 members of the European Parliament
ga: I láthair na huaire tá 766 Feisire de chuid Pharlaimint na hEorpa (FPE) ann

source: Find out about the role and functions of members of the European Parliament (MEPs)
ga: Tá cur síos sa cháipéis seo ar ról agus feidhmeanna Baill de Pharlaimint na hEorpa - Feisirí Eorpacha

source: European Parliament Political Groups
ga: Grúpaí Polaitiúla Aontas na hEorpa

source: There are eight political groups in the European Parliament, representing a range of political views
ga: Tá 8 gcinn de ghrúpaí polaitiúla i bParlaimint na hEorpa ag déanamh ionadaíocht ar raon dearcthaí polaitiúla

source: The main task of the European Court of Auditors, is auditing and overseeing the accounts and budgets of the institutions of the European Union
ga: Tá sé mar phríomhdhualgas ag Cúirt na nIniúchóirí iniúchadh breathnú a dhéanamh ar chuntais agus na mbuiséad in institiúidí Aontas na hEorpa

source: The European Ombudsman safeguards the fundamental rights of citizens living in Europe by ensuring open and accountable administrations within the European Union
ga: Breathnaíonn Ombudsman na hEorpa i ndiaidh bunchearta saoránach atá ina gcónaí san Eoraip a chosaint tríd córais riaracháin oscailte agus freagrach taobh istigh d'Aontas na hEorpa a chinntiú

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann
